Repository: klix-app/klix-prestashop8-plugin
Catalog: spellpayment/translations/*/ModulesSpellpaymentAdmin.*.xlf
Languages: et_ee, lt_lt, lv_lv, ru_ru

# klixAdmin-ee-1
source: Sell more by accepting payments via cards, bank accounts and buy now, pay later instalments. All via a single integration!
et_ee: Müüge rohkem, võttes vastu makseid kaartide, pangakontode ja "osta kohe, maksa hiljem" osamaksete kaudu. Kõik üheainsa integratsiooni kaudu!

# klixAdmin-ee-2
source: Klix.app payments
et_ee: Klix.app maksed

# klixAdmin-ee-3
source: Are you sure you want to delete Klix.app module?
et_ee: Kas olete kindel, et soovite Klix.app moodulit kustutada?

# klixAdmin-ee-4
source: Enable API
et_ee: API lubamine

# klixAdmin-ee-5
source: Enable payment method selection
et_ee: Võimaldab makseviisi valiku

# klixAdmin-ee-6
source: If enabled, buyers will be able to choose the desired payment method directly in PrestaShop.
et_ee: Kui see on lubatud, saavad ostjad valida soovitud makseviisi otse PrestaShopis.

# klixAdmin-ee-7
source: Enable one click payment
et_ee: Võimaldage ühe klikiga maksmine

# klixAdmin-ee-8
source: Enable logging
et_ee: Logimise lubamine

# klixAdmin-ee-9
source: Thanks for using Klix.app payments
et_ee: Täname Klix.app maksete kasutamise eest<

# klixAdmin-ee-10
source: Awaiting payment
et_ee: Ootab makset

# klixAdmin-lt-1
source: Sell more by accepting payments via cards, bank accounts and buy now, pay later instalments. All via a single integration!
lt_lt: Parduokite daugiau priimdami mokėjimus kortelėmis bei banko sąskaitomis ir suteikdami galimybę pirkti dabar, mokėti vėliau. Viskas per vieną integraciją!

# klixAdmin-lt-2
source: Klix.app payments
lt_lt: Klix.app mokėjimai

# klixAdmin-lt-3
source: Are you sure you want to delete Klix.app module?
lt_lt: Ar tikrai norite pašalinti Klix.app modulį?

# klixAdmin-lt-4
source: Enable API
lt_lt: Įjungti modulį

# klixAdmin-lt-5
source: Enable payment method selection
lt_lt: Įjungti mokėjimo būdo pasirinkimą

# klixAdmin-lt-6
source: If enabled, buyers will be able to choose the desired payment method directly in PrestaShop.
lt_lt: Jei ši funkcija įjungta, pirkėjai galės pasirinkti norimą mokėjimo būdą tiesiogiai PrestaShop parduotuvėje.

# klixAdmin-lt-7
source: Enable one click payment
lt_lt: Įjungti mokėjimą vienu paspaudimu

# klixAdmin-lt-8
source: Enable logging
lt_lt: Įjungti registravimo žurnalą

# klixAdmin-lt-9
source: Thanks for using Klix.app payments
lt_lt: Dėkojame, kad naudojatės Klix.app

# klixAdmin-lt-10
source: Awaiting payment
lt_lt: Laukiama apmokėjimo

# klixAdmin-lv-1
source: Sell more by accepting payments via cards, bank accounts and buy now, pay later instalments. All via a single integration!
lv_lv: Pārdodiet vairāk, pieņemot maksājumus ar kartēm, bankas saitēm un pērc tagad, maksā vēlāk nomaksu. Tas viss, izmantojot vienu integrāciju!

# klixAdmin-lv-2
source: Klix.app payments
lv_lv: Klix.app maksājumi

# klixAdmin-lv-3
source: Are you sure you want to delete Klix.app module?
lv_lv: Vai esat pārliecināts, ka vēlaties dzēst Klix.app moduli?

# klixAdmin-lv-4
source: Enable API
lv_lv: Aktivizēt API

# klixAdmin-lv-5
source: Enable payment method selection
lv_lv: Iespējot maksājumu metodes izvēli

# klixAdmin-lv-6
source: If enabled, buyers will be able to choose the desired payment method directly in PrestaShop.
lv_lv: Ja iespējota, pircēji varēs izvēlēties vēlamo maksājuma metodi pašā PrestaShop.

# klixAdmin-lv-7
source: Enable one click payment
lv_lv: Ieslēgt viena klikšķa maksājumus

# klixAdmin-lv-8
source: Enable logging
lv_lv: Ieslēgt žurnālošanu

# klixAdmin-lv-9
source: Thanks for using Klix.app payments
lv_lv: Paldies, ka izmantojat Klix.app maksājumus

# klixAdmin-lv-10
source: Awaiting payment
lv_lv: Gaida maksājumu

# klixAdmin-ru-1
source: Sell more by accepting payments via cards, bank accounts and buy now, pay later instalments. All via a single integration!
ru_ru: Продавайте больше, принимая оплату картами, банковскими ссылками и в рассрочку. Всё в одной интеграции!

# klixAdmin-ru-2
source: Klix.app payments
ru_ru: Klix.app платежи

# klixAdmin-ru-3
source: Are you sure you want to delete Klix.app module?
ru_ru: Вы уверены, что хотите удалить модуль Klix.app?

# klixAdmin-ru-4
source: Enable API
ru_ru: Включить API

# klixAdmin-ru-5
source: Enable payment method selection
ru_ru: Включить выбор способа оплаты

# klixAdmin-ru-6
source: If enabled, buyers will be able to choose the desired payment method directly in PrestaShop.
ru_ru: Если эта функция включена, покупатели смогут выбрать желаемый способ оплаты непосредственно в PrestaShop.

# klixAdmin-ru-7
source: Enable one click payment
ru_ru: Включить оплату в один клик

# klixAdmin-ru-8
source: Enable logging
ru_ru: Включить ведение журнала

# klixAdmin-ru-9
source: Thanks for using Klix.app payments
ru_ru: Спасибо за использование платежей Klix.app

# klixAdmin-ru-10
source: Awaiting payment
ru_ru: Ожидание оплаты
